---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MaterialIdParam
source: html/b076a32a-0493-c6de-55d5-5f142dd83488.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MaterialIdParam Property

"Material"

## Syntax (C#)
```csharp
public static ForgeTypeId MaterialIdParam { get; }
```